#+TITLE:  Mila.cat Configuration and Deployment
#+AUTHOR: Dmitri Brengauz
#+EMAIL:  dmitri@momus.net
#+DATE:   3 March 2016
#+TAGS:   freebsd technical
#+DESCRIPTION: Setup for Mila.cat development and deploy

* What am I doing?
  The idea of literate programing holds obvious attractions; the idea
  of literate DevOps even more so: in theory, an enitre site can be
  constructed from one well written Org-mode file, and even a complete
  testing/development environment that mirrors the site can be spun up
  with just a few keystrokes. For me, this idea went from hopeful
  Google term to something approaching reality when I stumbled across
  [[http://www.howardism.org/Technical/Emacs/literate-devops.html][this blog post]].

*** Preliminary steps:
    1. Create project directory, create this file inside of it.
    2. Create a Vagrantfile in this directory for dev/testing
    3. Incorporate Vagrantfile into this document
    4. Use steps divined for Vagrantfile to configure production
       server on Digital Ocean
    6. Profit!!!

*** TODO [0/2] Modify [[https://github.com/wunki/vagrant-freebsd/blob/master/Vagrantfile][wunki's]] Vagrantfile, to suit our needs.:

     - [ ] Resize the hard disk. Default is ridiculously small.
       The virtual disk dosen't seem to grow. [[http://tomasz.korwel.net/2014/01/03/growing-zfs-pool/][Growing ZFS Pool]] may help

     - [ ] Out of the box, wunki uses Virtual box. Change this to libvirt for a speedup.
     #+BEGIN_SRC ruby :tangle Vagrantfile
       # -*- mode: ruby; -*-

       
       ENV['VAGRANT_DEFAULT_PROVIDER'] = 'virtualbox'

       Vagrant.configure("2") do |config|
         config.vm.guest = :freebsd
         config.vm.network "public_network"
     #+END_SRC
     
     - [ ] Initially, NFS shared folders don't work. Right now, I don't care.

       
     #+BEGIN_SRC ruby :tangle Vagrantfile
       # Use NFS as a shared folder
       #config.vm.synced_folder ".", "/vagrant", :nfs => true, id: "vagrant-root"

       config.vm.provider :virtualbox do |vb, override|
         override.vm.box_url = "https://wunki.org/files/freebsd-10.2-amd64-wunki.box"
         override.vm.box = "freebsd-10.2-amd64-wunki"

         # vb.customize ["startvm", :id, "--type", "gui"]
         vb.customize ["modifyvm", :id, "--memory", "512"]
         vb.customize ["modifyvm", :id, "--cpus", "2"]
         vb.customize ["modifyvm", :id, "--hwvirtex", "on"]
         vb.customize ["modifyvm", :id, "--audio", "none"]
                  vb.customize ["modifyvm", :id, "--nictype1", "virtio"]
                  vb.customize ["modifyvm", :id, "--nictype2", "virtio"]
                end
       end
     #+END_SRC
     - [ ] Set up [[http://blog.osteel.me/posts/2015/01/25/how-to-use-vagrant-for-local-web-development.html][port forwarding]] to view the lovely Rails-Elm app in it's full glory.

*** Starting the VM
    Because of lag time, currently running "vagrant up" in an eterm buffer.

***** Vagrant vagrancies
     - virtual box depends on kernel modules, these have to manually
       be updated whenever the kernel packages are updated.
       1. Run `VBoxManage --version` to see if this is the problem.
       2. Then `sudo /etc/init.d/vboxdrv setup` to fix it.
     - `vagrant up` should be ready to go.
     - use `[[https://github.com/dergachev/vagrant-vbox-snapshot][vagrant plugin install vagrant-vbox-snapshot]]` for our
       current VBox setup
     - `vagrant snapshot take BOXNAME  NAME` before we go too crazy
        

*** Verifying the ssh connection
     #+BEGIN_SRC sh :dir /ssh:MilaVM:~
     uname -a
     #+END_SRC

     #+RESULTS:
     : FreeBSD vagrant-freebsd-10 10.2-RELEASE FreeBSD 10.2-RELEASE #0 r286666: Wed Aug 12 15:26:37 UTC 2015     root@releng1.nyi.freebsd.org:/usr/obj/usr/src/sys/GENERIC  amd64

*** Updating operating system before installing software
    `freebsd-update fetch` and `install` are meant to be used
    interactively, from here we can run the cron script
    #+BEGIN_SRC sh :dir /ssh:MilaVM:~
      sudo freebsd-update cron
    #+END_SRC
    update pkg packages
    #+BEGIN_SRC sh :dir /ssh:MilaVM:~
     sudo pkg upgrade --yes --quiet
    #+END_SRC

    #+RESULTS:
    | src component not installed                      | skipped |


* FreeBSD Rails server general system setup

*** Directory adjustments
    - Source directory for tarball installs
      #+BEGIN_SRC sh :dir /ssh:MilaVM:~
        mkdir ~/src
      #+END_SRC

*** Needful software
    - Git, of course
      #+BEGIN_SRC sh :dir /ssh:MilaVM:~
        sudo pkg install --yes --quiet git
        #For rails
        sudo pkg install --yes --quiet -r bison curl gdbm git libtool libxml2 libxslt
      #+END_SRC

      #+RESULTS:

   

*** Installing Ruby and Gems
    - Just to make things simple and perhaps secure, let's use FreeBSD's
      ruby package.  This will be my system ruby, so create a symbolic ling between
      the executable and /usr/bin/ruby
 
      #+BEGIN_SRC sh :dir /ssh:MilaVM:~
        sudo pkg install --yes --quiet ruby23
        sudo ln -s /usr/local/bin/ruby23 /usr/bin/ruby
        ruby --version
      #+END_SRC

      #+RESULTS:
      | The  | most    | recent      | version  |     of | packages          | are | already | installed |
      | ruby | 2.3.0p0 | (2015-12-25 | revision | 53290) | [amd64-freebsd10] |     |         |           |

    - Gems: download from Github, use ruby to install system-wide.
      This leaves a 23MB src directory, which could be removed if
      desperate for space.
      #+BEGIN_SRC sh :dir /ssh:MilaVM:~/src
        #git clone https://github.com/rubygems/rubygems
        #sudo ruby ~/src/rubygems/setup.rb
        sudo ln -s /usr/local/bin/gem23 /usr/bin/gem
        gem --version
      #+END_SRC

      #+RESULTS:
      : 2.6.3

*** Installing Apache
    Start with the [[https://www.freebsd.org/doc/handbook/network-apache.html][Basic Freebsd]] Apache installation:
    - Grab the package and install it:
      #+BEGIN_SRC sh :dir /ssh:MilaVM:~
        sudo pkg install --yes --quiet apache24 
      #+END_SRC

    - Initial run RESULTS:
      | ===>  Creating users and/or groups.
      | Using existing group 'www'.
      | Using existing user 'www'.
      | Message from apache24-2.4.18:
      | To run apache www server from startup, add yes
      | in your /etc/rc.conf. Extra options can be found in startup script.

      | Your hostname must be resolvable using at least 1 mechanism in    |
      | /etc/nsswitch.conf typically DNS or /etc/hosts or apache might    |
      | have issues starting depending on the modules you are using.      |
      |                                                                   |
      | !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! |
      |                                                                   |
      | apache24 default build changed from static MPM to modular MPM     |
      | - more modules are now enabled per default in the port            | 
      | - icons and error pages moved from WWWDIR to DATADIR              |
      |                                                                   |
      | If build with modular MPM and no MPM is  activated in             |
      | httpd.conf, then mpm_prefork will be activated as default         |
      | MPM in etc/apache24/modules.d to keep compatibility with          |
      | existing php/perl/python modules! |         |    |           |    |
      |                                                                   |
      | Please compare the existing httpd.conf with httpd.conf.sample     |
      | and merge missing modules/instructions into httpd.conf!           |
      |                                                                   |
      | !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! |

    - Modify /etc/rc.conf to start apache by default
      This I do directly now, but will script at later day;

    - Apache should start:
      #+BEGIN_SRC sh :dir /ssh:MilaVM:~
      sudo service apache24 start
      #+END_SRC

      #+RESULTS:
      | Performing | sanity    | check | on | apache24 | configuration: |
      | Starting   | apache24. |       |    |          |                |

*** Postgres
    Started with [[https://jasonk2600.wordpress.com/2010/01/11/installing-postgresql-on-freebsd/][this tutorial]]
    Install and enable on startup
    #+BEGIN_SRC sh :dir /ssh:MilaVM:~
      sudo pkg install --yes --quiet postgresql93-server postgresql93-client
      sudo echo postgresql_enable="YES" >> /etc/rc.conf
    #+END_SRC
    - Initialize PostgreSQL database cluster
      #+BEGIN_SRC sh :dir /ssh:MilaVM:~
      sudo /usr/local/etc/rc.d/postgresql initdb
      #+END_SRC

      #+RESULTS:
            | The  files belonging to this database system                              |
            | will be owned by user pgsql                                               |
            | This user must also own the server process                                |
            | The database cluster will be initialized with locale C                    |
            | The default text search configuration will be set to english              |
            | Data  page checksums are disabled.                                        |
            | Success.  You can now start the database server using:                    |
            | /usr/local/bin/postgres -D   /usr/local/pgsql/data                        |
            | or                                                                        |
            | /usr/local/bin/pg_ctl   -D   /usr/local/pgsql/data   -l   logfile   start |



      - /usr/local/pgsql/data/postgresql.conf
        set listen_address to 'localhost'
      - use password hash authentication for all hosts and users
        /usr/local/pgsql/data/pg_hba.conf
      - Start DBMS for first time and add a new super-user
        (with database and role creation rights
        - /usr/local/etc/rc.d/postgresql start
        -su pgsql
        - createuser -sdrP /username/
        - Enter password for new role:
        - Enter it again:

*** Install [[https://www.phusionpassenger.com/library/walkthroughs/deploy/ruby/ownserver/apache/oss/rubygems_norvm/install_passenger.html][Phusion Passenger]]
    - Install the gems
      #+BEGIN_SRC sh :dir /ssh:MilaVM:~
      sudo gem install passenger --no-rdoc --no-ri
      #+END_SRC

      - Initial  RESULTS:
        | Fetching:    | rake-11.1.2.gem                               |                  |
        | Successfully | installed                                     | rake-11.1.2      |
        | Fetching:    | rack-1.6.4.gem                                |                  |
        | Successfully | installed                                     | rack-1.6.4       |
        | Fetching:    | passenger-5.0.27.gem                          |                  |
        | Building     | native extensions. This could take a while... |                  |
        | Successfully | installed                                     | passenger-5.0.27 |
        | 3            | gems                                          | installed        |

    - run Passenger Apache module installer
      Had a [[https://github.com/phusion/passenger/issues/1586][problem]] compiling on the VM; 
      This is an interactive installer, so we will have to figure out
      how to automate this later
      #+ sh :dir /ssh:MilaVM:~
      sudo passenger-install-apache2-module
      #+END_SRC
      
      #+RESULTS:
      Please edit your Apache configuration file, and add these lines:
      
        LoadModule passenger_module /usr/local/lib/ruby/gems/2.3/gems/passenger-5.0.27/buildout/apache2/mod_passenger.so
       <IfModule mod_passenger.c>
       PassengerRoot /usr/local/lib/ruby/gems/2.3/gems/passenger-5.0.27
       PassengerDefaultRuby /usr/local/bin/ruby23
       </IfModule>
    
      After you restart Apache, you are ready to deploy any number of web
      applications on Apache, with a minimum amount of configuration!
    

       Checking whether the Passenger module is correctly configured in Apache... (!)
      
      You did not specify 'LoadModule passenger_module' in any of your Apache
      configuration files. Please paste the configuration snippet that this
      installer printed earlier, into one of your Apache configuration files, such
      as /usr/local/etc/apache24/httpd.conf.


   Detected 0 error(s), 1 warning(s)

   To learn how to deploy a web app on Passenger, please follow the deployment
   guide:

   https://www.phusionpassenger.com/library/deploy/apache/deploy/

   Enjoy Phusion Passenger, a product of Phusion (www.phusion.nl) :-)
   https://www.phusionpassenger.com


* Mila.cat Rails-Elm app

*** Install rails gem
    #+BEGIN_SRC sh :dir /ssh:MilaVM:~
      sudo pkg install --yes node-devel www/npm
      sudo gem install rails  --no-rdoc --no-ri
    #+END_SRC

***  [[https://www.digitalocean.com/community/tutorials/how-to-setup-ruby-on-rails-with-postgres][Postgres and Rails]]
     - Install the posrgres gem:
       #+BEGIN_SRC  sh :dir /ssh:MilaVM:~
       sudo gem install pg --no-doc --no-ri
       #+END_SRC
     - Create a user for the app:
         - sudo  su - pgsql
         - createuser --createdb -P -R -e /username/ 


***  Initialize application
    - Note taken on [2016-04-26 Tue 18:49]
     #+BEGIN_SRC sh :dir /ssh:MilaVM:~
       rails new mila --database=postgresql 
     #+END_SRC

     #+RESULTS:
     | [1m[32m  | create[0m                                              |                                                 |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | README.rdoc                                     |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | Rakefile                                        |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config.ru                                       |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | .gitignore                                      |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | Gemfile                                         |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | app                                             |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | app/assets/javascripts/application.js           |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | app/assets/stylesheets/application.css          |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | app/controllers/application_controller.rb       |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | app/helpers/application_helper.rb               |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | app/views/layouts/application.html.erb          |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | app/assets/images/.keep                         |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | app/mailers/.keep                               |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | app/models/.keep                                |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | app/controllers/concerns/.keep                  |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | app/models/concerns/.keep                       |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | bin                                             |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | bin/bundle                                      |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | bin/rails                                       |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | bin/rake                                        |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | bin/setup                                       |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config                                          |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/routes.rb                                |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/application.rb                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/environment.rb                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/secrets.yml                              |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/environments                             |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/environments/development.rb              |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/environments/production.rb               |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/environments/test.rb                     |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/initializers                             |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/initializers/assets.rb                   |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/initializers/backtrace_silencers.rb      |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/initializers/cookies_serializer.rb       |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/initializers/filter_parameter_logging.rb |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/initializers/inflections.rb              |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/initializers/mime_types.rb               |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/initializers/session_store.rb            |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/initializers/wrap_parameters.rb          |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/locales                                  |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/locales/en.yml                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/boot.rb                                  |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | config/database.yml                             |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | db                                              |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | db/seeds.rb                                     |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | lib                                             |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | lib/tasks                                       |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | lib/tasks/.keep                                 |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | lib/assets                                      |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | lib/assets/.keep                                |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | log                                             |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | log/.keep                                       |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | public                                          |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | public/404.html                                 |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | public/422.html                                 |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | public/500.html                                 |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | public/favicon.ico                              |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | public/robots.txt                               |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | test/fixtures                                   |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | test/fixtures/.keep                             |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | test/controllers                                |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | test/controllers/.keep                          |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | test/mailers                                    |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | test/mailers/.keep                              |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | test/models                                     |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | test/models/.keep                               |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | test/helpers                                    |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | test/helpers/.keep                              |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | test/integration                                |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | test/integration/.keep                          |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | test/test_helper.rb                             |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | tmp/cache                                       |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | tmp/cache/assets                                |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | vendor/assets/javascripts                       |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | vendor/assets/javascripts/.keep                 |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | vendor/assets/stylesheets                       |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | create[0m                                              | vendor/assets/stylesheets/.keep                 |             |                                  |            |           |           |            |     |         |            |         |       |
     | [1m[32m  | run[0m                                                 | bundle                                          | install     |                                  |            |           |           |            |     |         |            |         |       |
     | Fetching     | gem                                                      | metadata                                        | from        | https://rubygems.org/........... |            |           |           |            |     |         |            |         |       |
     | Fetching     | version                                                  | metadata                                        | from        | https://rubygems.org/...         |            |           |           |            |     |         |            |         |       |
     | Fetching     | dependency                                               | metadata                                        | from        | https://rubygems.org/..          |            |           |           |            |     |         |            |         |       |
     | Resolving    | dependencies............................................ |                                                 |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | rake                                                     | 11.1.2                                          |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | i18n                                                     | 0.7.0                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | json                                                     | 1.8.3                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | minitest                                                 | 5.8.4                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | thread_safe                                              | 0.3.5                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | builder                                                  | 3.2.2                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | erubis                                                   | 2.7.0                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | mini_portile2                                            | 2.0.0                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | rack                                                     | 1.6.4                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | mime-types-data                                          | 3.2016.0221                                     |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | arel                                                     | 6.0.3                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | debug_inspector                                          | 0.0.2                                           | with        | native                           | extensions |           |           |            |     |         |            |         |       |
     | Using        | bundler                                                  | 1.11.2                                          |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | byebug                                                   | 8.2.4                                           | with        | native                           | extensions |           |           |            |     |         |            |         |       |
     | Installing   | coffee-script-source                                     | 1.10.0                                          |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | execjs                                                   | 2.6.0                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | thor                                                     | 0.19.1                                          |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | concurrent-ruby                                          | 1.0.1                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | multi_json                                               | 1.11.2                                          |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | pg                                                       | 0.18.4                                          |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | sass                                                     | 3.4.22                                          |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | tilt                                                     | 2.0.2                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | spring                                                   | 1.7.1                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | rdoc                                                     | 4.2.2                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | tzinfo                                                   | 1.2.2                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | nokogiri                                                 | 1.6.7.2                                         |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | rack-test                                                | 0.6.3                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | mime-types                                               | 3.0                                             |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | binding_of_caller                                        | 0.7.2                                           | with        | native                           | extensions |           |           |            |     |         |            |         |       |
     | Installing   | coffee-script                                            | 2.4.1                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | uglifier                                                 | 3.0.0                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | sprockets                                                | 3.6.0                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | sdoc                                                     | 0.4.1                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | activesupport                                            | 4.2.6                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | loofah                                                   | 2.0.3                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | mail                                                     | 2.6.4                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | rails-deprecated_sanitizer                               | 1.0.3                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | globalid                                                 | 0.3.6                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | activemodel                                              | 4.2.6                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | jbuilder                                                 | 2.4.1                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | rails-html-sanitizer                                     | 1.0.3                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | rails-dom-testing                                        | 1.0.7                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | activejob                                                | 4.2.6                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | activerecord                                             | 4.2.6                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | actionview                                               | 4.2.6                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | actionpack                                               | 4.2.6                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | actionmailer                                             | 4.2.6                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | railties                                                 | 4.2.6                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | sprockets-rails                                          | 3.0.4                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | coffee-rails                                             | 4.1.1                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | jquery-rails                                             | 4.1.1                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Using        | rails                                                    | 4.2.6                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | sass-rails                                               | 5.0.4                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | web-console                                              | 2.3.0                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Installing   | turbolinks                                               | 2.5.3                                           |             |                                  |            |           |           |            |     |         |            |         |       |
     | Bundle       | complete!                                                | 12                                              | Gemfile     | dependencies,                    | 55         | gems      | now       | installed. |     |         |            |         |       |
     | Use          | `bundle                                                  | show                                            | [gemname]`  | to                               | see        | where     | a         | bundled    | gem | is      | installed. |         |       |
     | Post-install | message                                                  | from                                            | rdoc:       |                                  |            |           |           |            |     |         |            |         |       |
     | Depending    | on                                                       | your                                            | version     | of                               | ruby,      | you       | may       | need       | to  | install | ruby       | rdoc/ri | data: |
     |              |                                                          |                                                 |             |                                  |            |           |           |            |     |         |            |         |       |
     | <=           | 1.8.6                                                    | :                                               | unsupported |                                  |            |           |           |            |     |         |            |         |       |
     | =            | 1.8.7                                                    | :                                               | gem         | install                          | rdoc-data; | rdoc-data | --install |            |     |         |            |         |       |
     | =            | 1.9.1                                                    | :                                               | gem         | install                          | rdoc-data; | rdoc-data | --install |            |     |         |            |         |       |
     | >=           | 1.9.2                                                    | :                                               | nothing     | to                               | do!        | Yay!      |           |            |     |         |            |         |       |

***** TODO Configure the application database
      What I have should work fine, but maybe look more into config/database.yml
      In general database.yml should look like this:
      #+BEGIN_SRC ruby
        development:
          adapter: postgresql
          encoding: unicode
          database: myapp_development
          pool: 5
          username: myapp
          password: password1

        test:
          adapter: postgresql
          encoding: unicode
          database: myapp_test
          pool: 5
          username: myapp
          password: password1
                  
      #+END_SRC
      but I am leaving it out of this file for now.
***** Initial Gemfile:
      made to look like the book, except version numbers with default Rails gave.
      Except web-console
      #+BEGIN_SRC sh :dir /ssh:MilaVM:~/mila/
      bundle install --without production
      #+END_SRC

      #+RESULTS:
      | Using        | rake                       |      11.1.2 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | i18n                       |       0.7.0 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | json                       |       1.8.3 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | minitest                   |       5.8.4 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | thread_safe                |       0.3.5 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | builder                    |       3.2.2 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | erubis                     |       2.7.0 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | mini_portile2              |       2.0.0 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | rack                       |       1.6.4 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | mime-types-data            | 3.2016.0221 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | arel                       |       6.0.3 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | debug_inspector            |       0.0.2 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | byebug                     |       8.2.4 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | coffee-script-source       |      1.10.0 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | execjs                     |       2.6.0 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | thor                       |      0.19.1 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | concurrent-ruby            |       1.0.1 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | multi_json                 |      1.11.2 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | pg                         |      0.18.4 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | bundler                    |      1.11.2 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | sass                       |      3.4.22 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | tilt                       |       2.0.2 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | spring                     |       1.7.1 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | rdoc                       |       4.2.2 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | tzinfo                     |       1.2.2 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | nokogiri                   |     1.6.7.2 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | rack-test                  |       0.6.3 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | mime-types                 |         3.0 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | binding_of_caller          |       0.7.2 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | coffee-script              |       2.4.1 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | uglifier                   |       3.0.0 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | sprockets                  |       3.6.0 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | sdoc                       |       0.4.1 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | activesupport              |       4.2.6 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | loofah                     |       2.0.3 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | mail                       |       2.6.4 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | rails-deprecated_sanitizer |       1.0.3 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | globalid                   |       0.3.6 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | activemodel                |       4.2.6 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | jbuilder                   |       2.4.1 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | rails-html-sanitizer       |       1.0.3 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | rails-dom-testing          |       1.0.7 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | activejob                  |       4.2.6 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | activerecord               |       4.2.6 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | actionview                 |       4.2.6 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | actionpack                 |       4.2.6 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | actionmailer               |       4.2.6 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | railties                   |       4.2.6 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | sprockets-rails            |       3.0.4 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | coffee-rails               |       4.1.1 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | jquery-rails               |       4.1.1 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | rails                      |       4.2.6 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | sass-rails                 |       5.0.4 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | web-console                |       2.3.0 |            |               |      |       |                 |                 |     |    |                 |
      | Using        | turbolinks                 |       2.5.3 |            |               |      |       |                 |                 |     |    |                 |
      | [32mBundle | complete!                  |          12 | Gemfile    | dependencies, | 55   | gems  | now             | installed.[0m |     |    |                 |
      | [32mGems   | in                         |         the | group      | production    | were | not   | installed.[0m |                 |     |    |                 |
      | [32mUse    | `bundle                    |        show | [gemname]` | to            | see  | where | a               | bundled         | gem | is | installed.[0m |

*****  rake db:setup
       #+BEGIN_SRC   sh :dir /ssh:MilaVM:~/mila/
       bundle exec rake db:setup
       bundle exec rake db:migrate
       #+END_SRC

       #+RESULTS:

***** starting server
      #+BEGIN_SRC    sh :dir /ssh:MilaVM:~/mila/
       bundle exec rails s -b 0.0.0.0      
      #+END_SRC

      #+RESULTS:

      
* Rails

*** Root Files

***** Gemfile
      - Source
              #+BEGIN_SRC ruby :tangle /ssh:MilaVM:mila/Gemfile
                source 'https://rubygems.org'


                gem 'rails', '4.2.6'
                gem 'pg', '~> 0.15'
                # Use SCSS for stylesheets
                gem 'sass-rails', '~> 5.0'
                # Use Uglifier as compressor for JavaScript assets
                gem 'uglifier', '>= 1.3.0'
                # Use CoffeeScript for .coffee assets and views
                gem 'coffee-rails', '~> 4.1.0'
                # See https://github.com/rails/execjs#readme for more supported runtimes
                # gem 'therubyracer', platforms: :ruby

                # Use jquery as the JavaScript library
                gem 'jquery-rails'
                # Turbolinks makes following links in your web application faster. 
                # Read more: https://github.com/rails/turbolinks
                gem 'turbolinks'
                # Build JSON APIs with ease. Read more: https://github.com/rails/jbuilder
                gem 'jbuilder', '~> 2.0'
                # bundle exec rake doc:rails generates the API under doc/api.
                gem 'sdoc', '~> 0.4.0', group: :doc

                # Use ActiveModel has_secure_password
                gem 'bcrypt', '~> 3.1.7'

                # Use Unicorn as the app server
                # gem 'unicorn'

                # Use Capistrano for deployment
                gem 'capistrano-rails', group: :development

                group :development, :test do
                  # Call 'byebug' anywhere in the code to stop execution and get a debugger console
                  gem 'byebug'
                end

                group :development do
                  # Access an IRB console on exception pages or by using <%= console %> in views
                  gem 'web-console', '~> 2.0'

                  # Spring speeds up development by keeping your application running in the background.
                  # Read more: https://github.com/rails/spring
                  gem 'spring'
                end


              #+END_SRC


      - Bundle update
        #+BEGIN_SRC sh  :results output :dir /ssh:MilaVM:~/mila/
        bundle update
        #+END_SRC

        #+RESULTS:
        #+begin_example
        Fetching gem metadata from https://rubygems.org/...........
        Fetching version metadata from https://rubygems.org/...
        Fetching dependency metadata from https://rubygems.org/..
        Resolving dependencies.........................
        Using rake 11.1.2
        Using i18n 0.7.0
        Using json 1.8.3
        Using minitest 5.8.4
        Using thread_safe 0.3.5
        Using builder 3.2.2
        Using erubis 2.7.0
        Using mini_portile2 2.0.0
        Using rack 1.6.4
        Using mime-types-data 3.2016.0221
        Using arel 6.0.3
        Using net-ssh 3.1.1
        Using bcrypt 3.1.11
        Using debug_inspector 0.0.2
        Using bundler 1.11.2
        [32mInstalling byebug 8.2.5 (was 8.2.4) with native extensions[0m
        Using capistrano-harrow 0.4.0
        Using coffee-script-source 1.10.0
        Using execjs 2.6.0
        Using thor 0.19.1
        Using concurrent-ruby 1.0.1
        [32mInstalling multi_json 1.11.3 (was 1.11.2)[0m
        Using pg 0.18.4
        Using spring 1.7.1
        Using rdoc 4.2.2
        Using tzinfo 1.2.2
        Using nokogiri 1.6.7.2
        Using rack-test 0.6.3
        Using mime-types 3.0
        Using net-scp 1.2.1
        Using binding_of_caller 0.7.2
        Using coffee-script 2.4.1
        Using uglifier 3.0.0
        Using sprockets 3.6.0
        Using sdoc 0.4.1
        Using activesupport 4.2.6
        Using loofah 2.0.3
        Using mail 2.6.4
        Using sshkit 1.10.0
        Using rails-deprecated_sanitizer 1.0.3
        Using globalid 0.3.6
        Using activemodel 4.2.6
        Using jbuilder 2.4.1
        Using rails-html-sanitizer 1.0.3
        Using airbrussh 1.0.1
        Using rails-dom-testing 1.0.7
        Using activejob 4.2.6
        Using activerecord 4.2.6
        Using capistrano 3.5.0
        Using actionview 4.2.6
        Using capistrano-bundler 1.1.4
        Using actionpack 4.2.6
        Using capistrano-rails 1.1.6
        Using actionmailer 4.2.6
        Using railties 4.2.6
        Using sprockets-rails 3.0.4
        Using coffee-rails 4.1.1
        Using rails 4.2.6
        Using web-console 2.3.0
        Using turbolinks 2.5.3
        [32mBundle updated![0m
        [32mGems in the group production were not installed.[0m
#+end_example


*** app

***** Assets

******* javascripts

********* application.js
          - source
            #+BEGIN_SRC javascript :tangle /ssh:MilaVM:mila/app/assets/javascripts/application.js
              // This is a manifest file that'll be compiled into application.js, which will include all the files
              // listed below.
              //
              // Any JavaScript/Coffee file within this directory, lib/assets/javascripts, vendor/assets/javascripts,
              // or any plugin's vendor/assets/javascripts directory can be referenced here using a relative path.
              //
              // It's not advisable to add code directly here, but if you do, it'll appear at the bottom of the
              // compiled file.
              //
              // Read Sprockets README (https://github.com/rails/sprockets#sprockets-directives) for details
              // about supported directives.


              //= require turbolinks
              //= require_tree .
            #+END_SRC



***** views

******* layouts

********* application.html.erb
          - source
            #+BEGIN_SRC html :tangle /ssh:MilaVM:/home/vagrant/mila/app/views/layouts/application.html.erb
              <!DOCTYPE html>
              <html>
                <head>
                  <title>Mila</title>
                  <%= stylesheet_link_tag    'application', media: 'all', 'data-turbolinks-track' => true %>
                  <%= javascript_include_tag 'application', 'data-turbolinks-track' => true %>
                  <%= csrf_meta_tags %>
                </head>
                <body>

                  <%= yield %>
                  
                </body>
              </html>

            #+END_SRC

********* TODO home.html.erb
          Make a more "custom" Elm compiplation target that works better with application.html.erb
          - copied from Mila.elm/index.html
            #+BEGIN_SRC sh :results output :dir Mila.elm
              elm make Mila.elm --warn --output home.html
              scp home.html MilaVM:mila/app/views/static_pages/home.html.erb
            #+END_SRC

            #+RESULTS:
            : Success! Compiled 1 modules.
            : Successfully generated home.html


*** Test

***** Controller

******* Static Pages
        #+NAME: static_pages_controller_test.rb
        #+BEGIN_SRC ruby  :tangle /ssh:MilaVM:~/mila/test/controllers/static_pages_controller_test.rb
          require 'test_helper'

          class StaticPagesControllerTest < ActionController::TestCase
            test "should get home" do
              get :home
              assert_response :success
            end

            test "should get help" do
              get :help
              assert_response :success
            end

             test "should get about" do
               get :about
               assert_response :success
             end

          end 

        #+END_SRC

******* Running Tests
        - just this controller's test
          #+BEGIN_SRC sh :results output  :dir /ssh:MilaVM:~/mila/
            bundle exec rake test test/controllers/static_pages_controller_test.rb
          #+END_SRC

          #+RESULTS:
          : Run options: --seed 36006
          : 
          : # Running:
          : 
          : ...
          : 
          : Finished in 0.491675s, 6.1016 runs/s, 6.1016 assertions/s.
          : 
          : 3 runs, 3 assertions, 0 failures, 0 errors, 0 skips


*** Config
***** Routes
      - routes.rb
        #+BEGIN_SRC ruby :tangle /ssh:MilaVM:/home/vagrant/mila/config/routes.rb
          Rails.application.routes.draw do

            # Priority is based on order of creation: first created -> highest priority.
            # See how all your routes lay out with "rake routes".

            # Root of your site routed with "root"
            root 'static_pages#home'

            ## Static pages controller serves static pages.

            get '/help' => 'static_pages#help'
            get '/about' => 'static_pages#about'

          end
        #+END_SRC

***** environments
      - development
        #+BEGIN_SRC ruby :tangle /ssh:MilaVM:mila/config/environments/development.rb
          Rails.application.configure do
            # Settings specified here will take precedence over those in config/application.rb.

            #Allow rails console to be accessed by non-Internet routed networks
            config.web_console.whitelisted_ips = '192.168.0.0/16', '10.0.0.0/8', '172.16.0.0/12'
            
            # In the development environment your application's code is reloaded on
            # every request. This slows down response time but is perfect for development
            # since you don't have to restart the web server when you make code changes.
            config.cache_classes = false

            # Do not eager load code on boot.
            config.eager_load = false

            # Show full error reports and disable caching.
            config.consider_all_requests_local       = true
            config.action_controller.perform_caching = false

            # Don't care if the mailer can't send.
            config.action_mailer.raise_delivery_errors = false

            # Print deprecation notices to the Rails logger.
            config.active_support.deprecation = :log

            # Raise an error on page load if there are pending migrations.
            config.active_record.migration_error = :page_load

            # Debug mode disables concatenation and preprocessing of assets.
            # This option may cause significant delays in view rendering with a large
            # number of complex assets.
            config.assets.debug = true

            # Asset digests allow you to set far-future HTTP expiration dates on all assets,
            # yet still be able to expire them through the digest params.
            config.assets.digest = true

            # Adds additional error checking when serving assets at runtime.
            # Checks for improperly declared sprockets dependencies.
            # Raises helpful error messages.
            config.assets.raise_runtime_errors = true

            # Raises error for missing translations
            # config.action_view.raise_on_missing_translations = true
          end

        #+END_SRC

    

*** Controllers

***** StaticPage Controller
      - Generation
        #+BEGIN_SRC  sh :dir /ssh:MilaVM:~/mila/
          bundle exec rails generate controller StaticPages home help
        #+END_SRC

        #+RESULTS:
        | create | app/controllers/static_pages_controller.rb       |                     |
        | route  | get                                              | 'static_pages/help' |
        | route  | get                                              | 'static_pages/home' |
        | invoke | erb                                              |                     |
        | create | app/views/static_pages                           |                     |
        | create | app/views/static_pages/home.html.erb             |                     |
        | create | app/views/static_pages/help.html.erb             |                     |
        | invoke | test_unit                                        |                     |
        | create | test/controllers/static_pages_controller_test.rb |                     |
        | invoke | helper                                           |                     |
        | create | app/helpers/static_pages_helper.rb               |                     |
        | invoke | test_unit                                        |                     |
        | invoke | assets                                           |                     |
        | invoke | coffee                                           |                     |
        | create | app/assets/javascripts/static_pages.coffee       |                     |
        | invoke | scss                                             |                     |
        | create | app/assets/stylesheets/static_pages.scss         |                     |

******* Source
        #+BEGIN_SRC ruby :tangle /ssh:MilaVM:~/mila/app/controllers/static_pages_controller.rb
          class StaticPagesController < ApplicationController
            def home
            end

            def help
            end

            def about
            end
          end

        #+END_SRC

******* 

***** User Controller


*** Models


* Elm

*** Initializatoin
    1. Create local dir, Mila.elm
       Might as well check into repo.
    2. 
       

*** Mila.elm
    - Source
      #+BEGIN_SRC elm :tangle Mila.elm/Mila.elm
        module Mila (..) where

        import Html exposing (..)
        import Html.Attributes exposing (..)

        import String


        title message times =
          message
            |> String.toUpper
            |> String.repeat times
            |> text

        pageHeader =
          h1 [ ] [ title   "¡Mila! " 3 ]


        pageFooter =
          h3 [ ]
            [ text "pròximament"
            ]

        view =
          div [ id "container" ]
              [ pageHeader, pageFooter ]

        main =
          view        
              
               

      #+END_SRC
    - Compilation
      #+BEGIN_SRC sh :results output :dir Mila.elm
        ##REM: elm package install evancz/elm-html
        elm make Mila.elm --output mila.js
      #+END_SRC

      #+RESULTS:
      : Success! Compiled 0 modules.
      : Successfully generated mila.js




* Digital Ocean Deploy

*** Capistrano

***** install Capistrano files
      - initial creation
        #+BEGIN_SRC sh :results output :dir /ssh:MilaVM:~/mila/
         cap install                  
        #+END_SRC

      - new files:
        config/deploy.rb
        config/deploy/staging.rb
        config/deploy/production.rb already exists
        mkdir -p lib/capistrano/tasks
        Capfile

        #+RESULTS:
        : Capified

      - 


***** config/deploy.rb
      #+BEGIN_SRC ruby :tangle /ssh:MilaVM:mila/config/deploy.rb
              # config valid only for current version of Capistrano
        lock '3.5.0'

        set :application, 'mila'
        set :repo_url, 'git@github.com:Momus/mila.git'

        # Default branch is :master
        # ask :branch, `git rev-parse --abbrev-ref HEAD`.chomp

        # Default deploy_to directory is /var/www/my_app_name
        # set :deploy_to, '/var/www/my_app_name'

        # Default value for :scm is :git
        # set :scm, :git

        # Default value for :format is :airbrussh.
        set :format, :pretty

        # You can configure the Airbrussh format using :format_options.
        # These are the defaults.
        # set :format_options, command_output: true, log_file: 'log/capistrano.log', color: :auto, truncate: :auto

        # Default value for :pty is false
        set :pty, true

        # Default value for :linked_files is []
        # set :linked_files, fetch(:linked_files, []).push('config/database.yml', 'config/secrets.yml')

        # Default value for linked_dirs is []
        # set :linked_dirs, fetch(:linked_dirs, []).push('log', 'tmp/pids', 'tmp/cache', 'tmp/sockets', 'public/system')

        # Default value for default_env is {}
        # set :default_env, { path: "/opt/ruby/bin:$PATH" }

        # Default value for keep_releases is 5
        # set :keep_releases, 5

        namespace :deploy do

          after :restart, :clear_cache do
            on roles(:web), in: :groups, limit: 3, wait: 10 do
              # Here we can do anything such as:
              # within release_path do
              #   execute :rake, 'cache:clear'
              # end
            end
          end

        end

      #+END_SRC



* Wrong Turns


*** Elm  [[https://www.npmjs.com/package/elm][Installation]] -- on development only.
    NPM was already installed when installing the Rails gem. However this:
    #+BEGIN_SRC sh :results output :dir /ssh:MilaVM:~/mila/ 
    sudo npm install -g elm
    #+END_SRC
    does not work because there are currently ([2016-04-30 Sat]) no
    FreeBSD binaries in npm. So we have to do it the [[https://github.com/elm-lang/elm-platform][old fasioned]] way:
     1. Get Haskell Working
        #+BEGIN_SRC sh :results output :dir /ssh:MilaVM:~/mila/src
          sudo pkg install --yes lang/ghc
          sudo pkg install --yes hs-cabal-install

        #+END_SRC

        1. New packages to be INSTALLED:
           ghc: 7.10.2
           libiconv: 1.14_9
           gmp: 5.1.3_3
           gcc: 4.8.5_2
           mpc: 1.0.3
           mpfr: 3.1.3_1
           binutils: 2.25.1_1,1
           gcc-ecj: 4.5

           Message from gcc-4.8.5_2:
           To ensure binaries built with this toolchain find appropriate versions
           of the necessary run-time libraries, you may want to link using
     
           -Wl,-rpath=/usr/local/lib/gcc48
      
            For ports leveraging USE_GCC, USES=compiler, or USES=fortran this happens
            transparently.

     2. Actually Build Elm Things
        For some reason, does not build binaries on FreeBSD.




*** Rbenv later? 
    Because of this [[https://www.ixsystems.com/blog/freebsd-on-rails/][iX Systems Article]] I decided on rbenv to install
    ruby.

    #+BEGIN_SRC sh :dir /ssh:MilaVM:~
    sudo pkg install --yes  --quiet devel/rbenv
    #+END_SRC

    - Install the [[https://github.com/rbenv/ruby-build#readme][ruby-build]] plugin to ease install of rubies.
      #+BEGIN_SRC sh :dir /ssh:MilaVM:~
        git clone https://github.com/rbenv/ruby-build.git ~/.rbenv/plugins/ruby-build
      #+END_SRC
    - Using ruby-build, fetch and install the proper ruby:
      #+BEGIN_SRC sh :dir /ssh:MilaVM:~
      
      #+END_SRC


    #+RESULTS:

    
  

